# config/settings.py

# URL API, що використовується для запитів до Checkbox
BASE_URL = 'https://api.checkbox.in.ua/api/v1'

# Назва клієнта (інтеграції) і версія для заголовків запитів
CLIENT_NAME = 'IOClient'
CLIENT_VERSION = '1.0'

# Файли для збереження токена та даних про каси
TOKEN_FILE = 'data/token.json'
KASAS_FILE = 'data/kasas.json'

# Регулярний вираз для перевірки формату Telegram токена
TELEGRAM_TOKEN_REGEX = r'^\d+:.+'

# Інтервали опитування (у секундах) для відкритої/закритої зміни
POLL_INTERVAL_OPEN = 10      # для відкритої зміни
POLL_INTERVAL_CLOSED = 30    # для закритої зміни

# --- Налаштування логування ---
# Загальний рівень логування
LOG_LEVEL = 'INFO'
# Каталог для лог-файлів
LOG_DIR = 'logs'
# Максимальна кількість лог-файлів, після досягнення якої видаляються найстаріші
MAX_LOG_FILES = 10
# Формат повідомлень логування
LOG_FORMAT = '[%(asctime)s] [%(levelname)s] [%(name)s] %(message)s'

# --- Налаштування для налагодження ---
# Логувати детальну інформацію для змін (наприклад, дані отримані від API щодо зміни)
DEBUG_SHIFT_LOG = False
# Логувати базову інформацію по чеку
DEBUG_RECEIPT_INFO = True
# Детальний лог (повна інформація) при запиті розширених даних про чек
DEBUG_RECEIPT_DETAILS = False

DEBUG_WITHDRAWAL_LOG = False # відключено, до видалення.

# --- Налаштування оптимізації опитування чеків ---
# Використовуємо "короткий" запит – порівнюємо лише останній ID чеку,
# а розширені дані отримуємо лише при виявленні нового чеку.
SHORT_RECEIPT_OPTIMIZATION = True